#ifndef __delay_H
#define __delay_H 
  
////////////////////////////////////////////////////////////////////////////////// 

//代码功能：  系统延时功能函数文件

//STM32F4工程模板-库函数版本
//DevEBox  大越创新
//淘宝店铺：mcudev.taobao.com
//淘宝店铺：shop389957290.taobao.com	

//********************************************************************************

//修改说明
//无

////////////////////////////////////////////////////////////////////////////////// 	 

#include "main.h"

void Delay_Decrement(void);//减量函数

void delay_ms(__IO uint32_t nTime);//延时 mS 计数函数


#endif




















/********************************************************************/


//STM32F4工程模板-库函数版本
//DevEBox  大越创新
//淘宝店铺：mcudev.taobao.com
//淘宝店铺：shop389957290.taobao.com	

/********************************************************************/















