


#include "delay.h"


//////////////////////////////////////////////////////////////////////////////////  

//代码功能：  系统延时功能函数文件

//STM32F4工程模板-库函数版本
//DevEBox  大越创新
//淘宝店铺：mcudev.taobao.com
//淘宝店铺：shop389957290.taobao.com	

//********************************************************************************

//修改说明
//无

////////////////////////////////////////////////////////////////////////////////// 
 

static __IO uint32_t uwTimingDelay;  //节拍的  ms 数

/**********************************************************************

  * @brief  Decrements the TimingDelay variable.
  * @param  None  计数减量函数
  * @retval None
	
*********************************************************************/
	
	
void Delay_Decrement(void)
{
  if (uwTimingDelay != 0x00)
  { 
    uwTimingDelay--;
  }
}


/********************************************************************

  * 函数名称： void delay_ms(__IO uint32_t nTime)
  * 函数功能： nTime: specifies the delay time length, in milliseconds. 
               

 *******************************************************************/

void delay_ms(__IO uint32_t nTime)
{ 
  uwTimingDelay = nTime;

  while(uwTimingDelay != 0);
}
						    




			 













/********************************************************************/


//STM32F4工程模板-库函数版本
//DevEBox  大越创新
//淘宝店铺：mcudev.taobao.com
//淘宝店铺：shop389957290.taobao.com	

/********************************************************************/





























